In [1]:
import pandas as pd
import numpy as np
dict1={"University_name":['CU','PU','LPU','JNU'],"Student_name":['abhinav','abhishek','asmi','arushi'],"Marks":['72','78','20','30']}
df=pd.DataFrame(dict1)
print(df)

  University_name Student_name Marks
0              CU      abhinav    72
1              PU     abhishek    78
2             LPU         asmi    20
3             JNU       arushi    30

In [5]:
pip install pandas

Collecting pandas
  Downloading pandas-1.5.3-cp310-cp310-macosx_10_9_x86_64.whl (12.0 MB)
     |████████████████████████████████| 12.0 MB 3.2 MB/s eta 0:00:01
Requirement already satisfied: python-dateutil>=2.8.1 in /Users/abhinav/.conda/envs/pythonProject2/lib/python3.10/site-packages (from pandas) (2.8.2)
Collecting pytz>=2020.1
  Using cached pytz-2022.7.1-py2.py3-none-any.whl (499 kB)
Collecting numpy>=1.21.0
  Downloading numpy-1.24.2-cp310-cp310-macosx_10_9_x86_64.whl (19.8 MB)
     |████████████████████████████████| 19.8 MB 12 kB/s eta 0:00:013
Requirement already satisfied: six>=1.5 in /Users/abhinav/.conda/envs/pythonProject2/lib/python3.10/site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)
Installing collected packages: pytz, numpy, pandas
Successfully installed numpy-1.24.2 pandas-1.5.3 pytz-2022.7.1
Note: you may need to restart the kernel to use updated packages.

In [ ]:
df.to_csv('sample.csv')

:

In [40]:
df.to_csv('withoutIndex.csv',index=False)

In [34]:
rrv=pd.read_csv("/Users/abhinav/Downloads/withoutindex.csv")

In [35]:
rrv.head()

  University_name Student_name  Marks  year
0              CU      abhinav     72  2002
1              PU     abhishek     78  2003
2             LPU         asmi     20  2004
3             JNU       arushi     30  2005
4             JNU       arushi     30  2005

In [36]:
rrv.drop_duplicates()

  University_name Student_name  Marks  year
0              CU      abhinav     72  2002
1              PU     abhishek     78  2003
2             LPU         asmi     20  2004
3             JNU       arushi     30  2005

In [30]:
rrv.describe()

           Marks        year
count   5.000000     5.00000
mean   42.000000  2003.80000
std    31.016125     1.30384
min    10.000000  2002.00000
25%    20.000000  2003.00000
50%    30.000000  2004.00000
75%    72.000000  2005.00000
max    78.000000  2005.00000

In [23]:
type(rrv)

pandas.core.frame.DataFrame

In [16]:
rrv.loc[0,'Marks']='exam'

In [17]:
rrv.head

<bound method NDFrame.head of   University_name Student_name Marks
0              CU      abhinav  exam
1              PU     abhishek    78
2             LPU         asmi    20
3             JNU       arushi    30>

In [17]:
df1=pd.DataFrame(np.random.rand(200,5),index=np.arange(200))

In [18]:
df1.shape

(200, 5)

In [19]:
df1

            0         1         2         3         4
0    0.367223  0.964652  0.938417  0.164977  0.541859
1    0.744890  0.320685  0.733645  0.633557  0.086080
2    0.259905  0.994960  0.287527  0.232819  0.719387
3    0.951038  0.323305  0.230092  0.650923  0.832623
4    0.229535  0.539734  0.174219  0.865822  0.154995
..        ...       ...       ...       ...       ...
195  0.900104  0.492672  0.390523  0.594838  0.226674
196  0.746119  0.947093  0.758318  0.495986  0.606394
197  0.685922  0.120073  0.255818  0.343850  0.448114
198  0.451151  0.084905  0.757840  0.779260  0.746885
199  0.708149  0.694593  0.065653  0.642430  0.482331

[200 rows x 5 columns]